app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE (name LIKE '%sa%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (name LIKE '%%')
---
  def index
    # @products = Product.order("name").page(params[:page]).per_page(5)
    @products = Product.search(params[:search]).page(params[:page]).per_page(5)

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mangoes"], ["price", 30.0], ["created_at", "2019-12-29 18:17:18.455703"], ["updated_at", "2019-12-29 18:17:18.455703"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
UPDATE "products" SET "released_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["released_at", "2019-12-30 00:00:00"], ["updated_at", "2019-12-30 02:53:50.399789"], ["id", 48]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)