app/views/products/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."product_id" = ?  [["product_id", 34]]
---
<ul>
  <% @product.categories.each do |category| %>